{
    "usuarios": " You will be interacting with multiple users, each starting their sentence with a user id, such as 'user 12:'. Do not reference these user ids in your responses",
    "mapRequest": "necesito que me des las coordenadas del mapa que estamos jugando, en formato:\n'Jugador': [x, y],\n'Aliado 1': [x, y],\n'Aliado 2': [x, y],\n'Enemigo 1': [x, y],\n'Enemigo 2': [x, y],\n y asi con todos los aliados y enemigos que esten en el mapa, los rangos de (x,y) son de 1 al 10, recuerda las comillas en 'nombre'. No me des contexto, solo las coordendas",
    "music_rules": "I need assistance in producing AI-generated text\nthat I convert to music using MIDI files. Initially,\nI'll provide a description of the format I need for\nthe textual representation of the music.\nSince music is a time-based art form,\nthe notes follow each other in time, and\nsometimes there are no notes, that is, silences.\nThe way I would like you to generate them is as\nfollows:\nEach note is represented as a tuple of two\nelements:\nThe pitch of the note (integer value).\nBecause I will use this text representation and\nconvert to MIDI the note should be a number\nfrom 21 (that is note A0 - 27,50 Hz) to 96 (that is\nC7 - 2093 hz) so use these numbers to represent\nthe note.\nThe duration of the note (float value)\nrepresented as:\n0.125 for an eighth note\n0.25 for a quarter note\n0.5 for a half note\n1 for a whole note\n2 for a double whole note\nBut could be any number between 0 and 2,\nbecause you know, musician are creative so why\nnot 0.29 or 1.22, etc.\nWith this format i need you generate a text that\ni will covert in music in this format:\nmelody_pitch_duration_data = [\n(note, duration), (note, duration), (note,\nduration),\netc,\n]\nAnd when there is a silence the note should be 0\nand the duration is how long is that silence.\nA melody is a linear sequence of notes that the\nlistener hears as a single entity. It is the\nforeground to the backing elements and is a\ncombination of pitch and rhythm. Sequences of\nnotes that comprise melody are musically\nsatisfying and are often the most memorable\npart of a song.\nThere are many ways to describe a melody. Here\nare a few:\n Pitch: The pitch of a melody is the relative\nhighness or lowness of the notes. Melodies\ncan be high, low, or somewhere in between.\n  Rhythm: The rhythm of a melody is the\npattern of long and short notes. Melodies can\nhave a slow, steady rhythm, a fast,\nsyncopated rhythm, or something in\nbetween.\n Intervals: Intervals are the distance between\nnotes. Melodies can use a variety of\nintervals, from small steps to large leaps.\n Contour: The contour of a melody is the\noverall shape of the melody. Melodies can be\nascending, descending, or something in\nbetween.\n Tonal center: The tonal center of a melody is\nthe note that the melody feels like it is\ncentered around. Melodies can have a strong\ntonal center, a weak tonal center, or no tonal\ncenter at all.\nWhen describing a melody, it is important to\nconsider all of these factors. The pitch, rhythm,\nintervals, contour, and tonal center all\ncontribute to the overall sound of the melody.\nHere are some examples of how to describe\nmelodies:\n The melody of \"Happy Birthday\" is simple and\nrepetitive, with a clear tonal center.\n The melody of \"Yesterday\" by The Beatles is\nmore complex, with a variety of intervals and\na changing tonal center.\n The melody of \"Bohemian Rhapsody\" by\nQueen is highly dramatic, with a wide range\nof pitches and rhythms.\nQuality melodies typically limit their range to\nabout an octave-and-a-half, feature repeating\nelements like melodic intervals and rhythmic\npatterns, and consist of stepwise motion with\noccasional energetic leaps. Good melodies also\ninteract meaningfully with the bass line,\nemploying a mix of parallel, similar, oblique, or\ncontrary motions for a dynamic, counter melodic\neffect. Finally, a standout melody tends to have\na climactic moment, often a high note with\nsignificant harmonization and strong rhythmic\nplacement, which then descends to a restful\ncadence.\nNo matter how it is described, a melody is one of\nthe most important elements of music. It is what\ngives a song its identity and makes it memorable.\nPlease note that AI-generated music may not\nsound pleasing as it is randomly generated so we\nwill use music theory but not random math so\ndon't randomize the generation process. take\ninto account musical concepts like scales,\nmodes, etc.\nNow that you have a full understanding of the\ntext representation, we will create some\nawesome music!\n. Are you ready to start generating music?\nIf so, respond with ‘YES’ and nothing else. ",
    "music_request": " ¿ que tipo de melodia seria buen ambiente para la situacion que estamos jugando?, no me respondas con otra pregunta",
    "request_start": "Okey, so give me a melody with the following theme:"
}